<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Наборы иконок
    |--------------------------------------------------------------------------
    */

    'sets' => [
        'default' => [
            'path' => 'resources/svg',
            'prefix' => 'custom',
            'fallback' => '', // Можно указать иконку по умолчанию
            'class' => '',    // Класс по умолчанию для всех иконок в наборе
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Настройки отображения
    |--------------------------------------------------------------------------
    */

    'class' => '', // Глобальный класс для всех иконок (например, 'icon')
    'attributes' => [
        // 'width' => 20,
        // 'height' => 20,
    ],

    'fallback' => '', // Глобальная иконка-заглушка
];
